docs: 架构图换成 mermaid
